# Pandas basics

[Pandas](https://pandas.pydata.org) is widely used for data analysis in Python and it makes the process of working with structured data easier. Pandas is built on top of NumPy (which we saw in [notebook 1](01-numpy-basics.ipynb)) and provides data structures which aid analytics as well as tools to manipulate and restructure data, and perform aggregations and queries on that data.


This notebook will give you a quick introduction to Pandas. Like the earlier notebooks in this workshop, some of the cells are in question-and-answer format, whilst some contain working code - make sure you think about what these cells are doing whilst going through the notebook.

Let's go! 

## Importing Pandas

It is common practise to import `pandas` with the alias of `pd`, thereby saving yourself 4 keystrokes every time you want to type the module name.

In [1]:
import pandas as pd

## Creating data structures

There are two data structures in pandas: `Series` and `DataFrames`. 

### Series

A pandas [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series) holds one dimensional data, and labels corresponding to the data. 

There are a few ways we can make a `Series` but perhaps the simplest is from an array of data.

In [2]:
dat = pd.Series(['alpha', 'gamma', 'delta', 'omega'])
dat

0    alpha
1    gamma
2    delta
3    omega
dtype: object

You can see that, as well as the data, the `Series` has indices, in this case the integers 0 to 3.

We can use these to select specific entries from the `Series`:

In [3]:
dat[3]

'omega'

How would you select the first 3 entries in `dat`?

In [4]:
# FIXME: only keep this in solution 

dat[0:3]

0    alpha
1    gamma
2    delta
dtype: object

If we decide we want to change the indexes of our `Series` we can do so as follows:

In [5]:
dat.index = ['a', 'g', 'd', 'o']
dat

a    alpha
g    gamma
d    delta
o    omega
dtype: object

## Initialising a series with the desired indexes and names

Instead of changing indexes and names once the `Series` has been initialised, you can do it all in one fell swoop. Using `help(pd.Series)` for guidance, make a new `Series` with the data below and the correct indices and names in one command:

In [6]:
## Ammend this code so the series
## has the correct indices and names

dat2 = pd.Series(['epsilon', 'lambda', 'mu'])

## only need this for the solution
dat2 = pd.Series(['epsilon', 'lambda', 'mu'], index = ['e','l','m'],
                 name = 'greek letters')
dat2

e    epsilon
l     lambda
m         mu
Name: greek letters, dtype: object

We can also give the index a name to aid understanding:

In [7]:
dat.index.name = 'latin'
dat

latin
a    alpha
g    gamma
d    delta
o    omega
dtype: object

##Â Making a Series from a dictionary

Another way to make a `Series` is from a Python dict object:

In [8]:
views = {'Cats': 798, 'Star Wars': 1938, 'Jumanji': 1802}
dat3 = pd.Series(views)
dat3

Cats          798
Star Wars    1938
Jumanji      1802
dtype: int64

### NumPy operations on Series

You can implement standard NumPy operations on Pandas objects like so:

In [9]:
dat3*2

Cats         1596
Star Wars    3876
Jumanji      3604
dtype: int64

When applying arithmetic to `Series`, they automatically apply the functions to data by aligning indexes.

dat4 = pd.Series({'Little Women':908, 'Star Wars': 1145, 'Cats':102})

dat3 + dat4

Note that if an index does not appear in all of the `Series` in the arithmetic, the resulting entry for that index will be `NaN`.

## DataFrames

As well as the one dimensional, indexed `Series` object, `pandas` contains a `DataFrame` object, which is more similar to a two dimensional spreadsheet, with both rows and columns. 

One easy way to make a data frame is from a Python Dictionary of Numpy Arrays arrays:

In [10]:
import numpy as np

np.datetime64('2015-07-04')

data = {'film':['Little Women', 'Cats', 'Jumanji', 'Star Wars'], 
       'mean views':[908, 102, 3604, 1145],
       'date': [np.datetime64('2019-12-25'), np.datetime64('2019-12-20'), np.datetime64('2019-12-04'), np.datetime64('2019-12-18')], 
       'run time':[135, 110, 123, 142]}

In [11]:
movie_df = pd.DataFrame(data) 
movie_df

           film  mean views       date  run time
0  Little Women         908 2019-12-25       135
1          Cats         102 2019-12-20       110
2       Jumanji        3604 2019-12-04       123
3     Star Wars        1145 2019-12-18       142

We used the numpy date and time functionality to format dates in our DataFrame. Remember that you can find out more about a function or object type using the ```help($function)``` command. 

As we saw with `Series`, rows of the `DataFrame` are indexed with integers. Using the `dir()` and `help()` functions, see if you can change the indexes of the DataFrame to the letters a to d.

In [12]:
#### Solution: 

movie_df.index=['a', 'b', 'c', 'd']
movie_df

           film  mean views       date  run time
a  Little Women         908 2019-12-25       135
b          Cats         102 2019-12-20       110
c       Jumanji        3604 2019-12-04       123
d     Star Wars        1145 2019-12-18       142

We can retrieve rows and columns of the DataFrame using their index names, like so:

In [13]:
movie_df['mean views']

a     908
b     102
c    3604
d    1145
Name: mean views, dtype: int64

In [14]:
movie_df.loc['b']

film                         Cats
mean views                    102
date          2019-12-20 00:00:00
run time                      110
Name: b, dtype: object

We can also add columns and ammend the DataFrame:

In [15]:
movie_df['theaters']=np.array([1093,987,4038,4874])
movie_df

           film  mean views       date  run time  theaters
a  Little Women         908 2019-12-25       135      1093
b          Cats         102 2019-12-20       110       987
c       Jumanji        3604 2019-12-04       123      4038
d     Star Wars        1145 2019-12-18       142      4874

We can also add additional rows to a `DataFrame` using the `.append` function. Columns will align based on names.

In [16]:
yday = pd.Series(['yesterday', '795', np.datetime64('2019-06-28'), '116', 'Lily James'])
yday.index = ['film', 'mean views', 'date', 'run time', 'star']

In [17]:
movie_df.append(yday, ignore_index=True)

           film mean views       date run time  theaters        star
0  Little Women        908 2019-12-25      135    1093.0         NaN
1          Cats        102 2019-12-20      110     987.0         NaN
2       Jumanji       3604 2019-12-04      123    4038.0         NaN
3     Star Wars       1145 2019-12-18      142    4874.0         NaN
4     yesterday        795 2019-06-28      116       NaN  Lily James

What do you notice has changed about the DataFrame?

We can also delete column from the data frame using the `.drop` function:

In [18]:
movie_df.drop(columns=['date'])

           film  mean views  run time  theaters
a  Little Women         908       135      1093
b          Cats         102       110       987
c       Jumanji        3604       123      4038
d     Star Wars        1145       142      4874

Can you use the `help` function to find out how to delete row b from the DataFrame, using the `.drop` function?

In [19]:
## Solution 

#help(pd.DataFrame.drop)
#movie_df.drop('b')

As well as adding and deleting data from the DataFrame it is important to be able to transform and apply functions to the data in the Data Frame. We can sort the frame by one (or more) of its columns using the `.sort_values` function:

In [22]:
movie_df.sort_values(by = 'mean views')

           film  mean views       date  run time  theaters
b          Cats         102 2019-12-20       110       987
a  Little Women         908 2019-12-25       135      1093
d     Star Wars        1145 2019-12-18       142      4874
c       Jumanji        3604 2019-12-04       123      4038

To illustrate other functions we can apply to the `DataFrame` let's first make a `DataFrame` that just contains the columns `mean views`, `run time` and `theaters`:

In [28]:
movie_df2 = movie_df[['mean views', 'run time', 'theaters']]
movie_df2

   mean views  run time  theaters
a         908       135      1093
b         102       110       987
c        3604       123      4038
d        1145       142      4874

We can compute the mean value down columns using the `.mean` function:

In [29]:
movie_df2.mean()

mean views    1439.75
run time       127.50
theaters      2748.00
dtype: float64

Using the 'axis' parameter we are able to apply the same function across the rows:

In [30]:
movie_df2.mean(axis=1)

a     712.000000
b     399.666667
c    2588.333333
d    2053.666667
dtype: float64

Take a look at the help function to see what other column summaries compute.

We can also apply functions we define to a `DataFrame`:

In [56]:
movie_df2.apply(lambda x: x^2)

   mean views  run time  theaters
a         910       133      1095
b         100       108       985
c        3606       121      4036
d        1147       140      4872